ct-focus-tcbs-profile-service/src/main/resources/SoapBody/account-open-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:FlexService>
            <tem:pv_params>{
                "funcname":"openAccount",
                "routecode":"Flex",
                "module":"AccountService",
                "referenceid": "{referenceid}",
                "fullname": "{fullname}",
                "gender":"001",
                "birthday": "16/12/1990",
                "idnumber":"{idnumber}",
                "idtype":"001",
                "iddate":"25/02/2021",
                "idplace":"",
                "email":"{email}",
                "phone":"{phone}",
                "address":"",
                "province":"",
                "bankaccountnumber":"",
                "bankaccountname":"",
                "bankname":"",
                "bankbranch":"",
                "bankcode":"",
                "custodycode":"11111111",
                "agentid":"",
                "tradingpass":"1feee9f2601185fd9b9fb924b60943fc",
                "tcdate":"",
                "tdcode":"",
                "country":"234",
                "taxcode":"",
                "vat":"N",
                "custatcom":"Y",
                "custtype":"I"
                }
            </tem:pv_params>
        </tem:FlexService>
    </soapenv:Body>
</soapenv:Envelope>